Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: While a { -brand-name-chromebook } already has { -brand-name-chrome } installed, downloading and using { -brand-name-firefox } as your go-to browser provides you with a few benefits
am: የ{ -brand-name-chromebook } አስቀድሞ { -brand-name-chrome } ተጭኖ እያለ { -brand-name-firefox }ን አውርደው እና ዋና አሳሽዎ አድርገው መጠቀም ጥቂት ጥቅሞችን ይሰጥዎታል

source: While { -brand-name-chrome } gets the nod with add-ons and extensions, { -brand-name-firefox } has a nicely curated set of built-in features, such as the incredibly handy screen capture tool, and reading mode feature which strips away everything from the page except the text from the article you’re reading.
am: { -brand-name-chrome } በ ተጨማሪዎች እና ቅጥያዎች ኖድ ሲያገኝ፣ { -brand-name-firefox } በሚያስደንቅ ሁኔታ ምቹ የስክሪን ቀረጻ መሳሪያ እና የማንበብ ሁነታ ያሉ አብሮ የተሰሩ ባህሪያት ስብስብ አለው ከሚያነቡት ጽሁፍ በስተቀር ሁሉንም ነገር ከገጹ ላይ የሚያራግፍ ባህሪይ አለው።

source: While { -brand-name-chrome } proves to be a safe web browser, its privacy record is questionable. { -brand-name-google } actually collects a disturbingly large amount of data from its users including location, search history and site visits. { -brand-name-google } makes its case for data collection saying it’s doing it to improve its services – like helping you find a sweater or a coffee shop like the one you previously bought or visited. However, others might disagree, making the point that { -brand-name-google } is actually gathering an unprecedented amount of data for its own marketing purposes. They tout that they’re keeping your information private from hackers, but that’s beside the point. { -brand-name-google } itself runs the world’s largest advertising network, thanks in large part to data they harvest from their users.
am: { -brand-name-chrome } ደህንነቱ የተጠበቀ የድር አሳሽ መሆኑን ቢያረጋግጥም፣ የግላዊነት መዝገቡ አጠራጣሪ ነው። { -brand-name-google } አካባቢን፣ የፍለጋ ታሪክን እና የጣቢያ ጉብኝቶችን ጨምሮ ከተጠቃሚዎቹ ብዙ የሚረብሽ ከፍተኛ መጠን ያለው ውሂብ ይሰበስባል። { -brand-name-google } አገልግሎቶቹን ለማሻሻል እየሰራው ነው በማለት መረጃ ለመሰብሰብ ጉዳዩን ያቀርባል - ልክ እንደ ከዚህ ቀደም እንደገዙት ወይም እንደጎበኟቸው አይነት ሹራብ ወይም የቡና መሸጫ ሱቅ እንዲያገኙ መርዳት። ነገር ግን፣ ሌሎች አይስማሙ ይሆናል፣ ይህም ነጥቡን { -brand-name-google } በእውነቱ ለራሱ የግብይት አላማ ከዚህ ቀደም ታይቶ የማይታወቅ መጠን ያለው ውሂብ እየሰበሰበ ነው። መረጃዎን ከጠላፊዎች ሚስጥራዊነቱን እየጠበቁት እንደሆነ ይናገራሉ፣ ነገር ግን ከነጥቡ ቀጥሎ ነው። { -brand-name-google } እራሱ የአለምን ትልቁን የማስታወቂያ አውታረመረብ ይሰራል፣በአብዛኛው ከተጠቃሚዎቻቸው ለሚሰበስቡት ውሂብ ምስጋና ይግባው።

source: Whole-device protection on every device
am: የሙሉ መሣሪያ ጥበቃ በእያንዳንዱ መሣሪያ ላይ

source: Who We Are
am: ሰለ እኛ

source: Why { -brand-name-mozilla-vpn }?
am: { -brand-name-mozilla-vpn } ለምን?

source: Why bundle?
am: ጥቅል ለምን?

source: With 2x the speed, built-in privacy protection and { -brand-name-mozilla } behind it, the new { -brand-name-firefox } is the better way to browse.
am: በ2x ፍጥነት፣ አብሮ የተሰራ የግላዊነት ጥበቃ እና { -brand-name-mozilla } ከኋላ የሚደግፈው፣ አዲሱ { -brand-name-firefox } ለማሰስ የተሻለው መንገድ ነው።

source: With { -brand-name-ie }, { -brand-name-microsoft } learned from its lack of availability across platforms and made { -brand-name-edge } available for { -brand-name-mac } and { -brand-name-android }. The software is now readily available on { -brand-name-ios }, { -brand-name-android }, { -brand-name-windows } and { -brand-name-mac }.
am: በ{ -brand-name-ie }፣ { -brand-name-microsoft } በመላ መድረኮች ላይ ካለመገኘቱ ተምሯል እናም { -brand-name-edge } ለ{ -brand-name-mac } እና { -brand-name-android } እንዲገኝ አድርጓል። ሶፍትዌሩ አሁን በ{ -brand-name-ios }፣ { -brand-name-android }፣ { -brand-name-windows } እና { -brand-name-mac } ላይ ይገኛል።

source: With { -brand-name-ie }, { -brand-name-microsoft } learned from its lack of availability across platforms and made { -brand-name-edge } readily available on { -brand-name-ios }, { -brand-name-android }, { -brand-name-windows }, { -brand-name-mac }, and soon { -brand-name-linux }.
am: በ{ -brand-name-ie }፣ { -brand-name-microsoft } በመላ መድረኮች ላይ ካለመገኘቱ ተምሯል እናም { -brand-name-edge } በ{ -brand-name-ios }፣ { -brand-name-android }፣ { -brand-name-windows }፣ { -brand-name-mac }፣ እና በቅርቡ { -brand-name-linux } ላይ በቀላሉ እንዲገኝ አድርጓል።

source: With { -brand-name-windows } 10, { -brand-name-microsoft } introduced its { -brand-name-edge } browser to compete with { -brand-name-firefox } and { -brand-name-chrome }, making it the default browser pre-installed on millions of PCs sold. Even so, users were slow to adopt it and { -brand-name-microsoft } eventually announced plans to relaunch { -brand-name-edge } as a { -brand-name-chromium }-based browser ({ -brand-name-chromium } is { -brand-name-google }’s Open Source browser project). Since January of 2020, { -brand-name-microsoft }’s { -brand-name-chromium }-based { -brand-name-edge } has replaced the previous versions of { -brand-name-edge }. Although { -brand-name-edge } is now built on { -brand-name-google }’s { -brand-name-chromium }, a number of unique features do set it apart from { -brand-name-google }’s { -brand-name-chrome } browser.
am: በ{ -brand-name-windows } 10፣ { -brand-name-microsoft } ከ{ -brand-name-firefox } እና { -brand-name-chrome } ጋር ለመወዳደር የ{ -brand-name-edge } አሳሹን አስተዋወቀ፤ በሚሊዮን በሚቆጠሩ ፒሲዎች ላይ አስቀድሞ የተጫነ ነባሪ አሳሽ ያደርገዋል። እንዲያም ሆኖ፣ ተጠቃሚዎች እሱን ለመቀበል ዘግይተው ነበር እና { -brand-name-microsoft }በመጨረሻ{ -brand-name-edge }ን እንደ { -brand-name-chromium } ላይ የተመሰረተ አሳሽ ({ -brand-name-chromium } ዳግም የ{ -brand-name-google } የክፍት ምንጭ አሳሽ ፕሮጀክት ነው።) ለማስጀመር ማቀዱን አስታውቀዋል። ከጃንዋሪ 2020 ጀምሮ፣ የ{ -brand-name-microsoft }{ -brand-name-chromium }-ላይ የተመሰረተ { -brand-name-edge } የቀድሞዎቹን የ{ -brand-name-edge } ተክቷል። ምንም እንኳን{ -brand-name-edge }አሁን የ{ -brand-name-google } በ{ -brand-name-chromium } ላይ ቢገነባም፣ በርካታ ልዩ ባህሪያት ከ{ -brand-name-google } የ{ -brand-name-chrome } አሳሽ ይለዩታል።

source: With { -brand-name-windows } 10, { -brand-name-microsoft } introduced its { -brand-name-edge } browser to compete with { -brand-name-firefox } and { -brand-name-chrome } making it the default browser pre-installed on millions of PCs sold. Even so, users were slow to adopt it and { -brand-name-microsoft } eventually announced plans to relaunch { -brand-name-edge } as a { -brand-name-chromium }-based browser ({ -brand-name-chromium } of course being { -brand-name-google }’s Open Source browser project).
am: በ{ -brand-name-windows } 10፣ { -brand-name-microsoft } ከ{ -brand-name-firefox } እና { -brand-name-chrome } ጋር ለመወዳደር የ{ -brand-name-edge } አሳሹን በማስተዋወቅ በሚሊዮኖች በሚቆጠሩ የተሸጡ ኮምፒውተሮች ላይ አስቀድሞ የተጫነ ነባሪ አሳሽ እንዲሆን ማድረግ ነበር። እንዲያም ሆኖ፣ ተጠቃሚዎች እሱን ለመቀበል ዘግይተው ነበር እና { -brand-name-microsoft } በመጨረሻ { -brand-name-edge }ን እንደ { -brand-name-chromium } ላይ የተመሰረተ አሳሽ ዳግም ለማስጀመር ማቀዱን አስታውቀዋል (በእርግጥ { -brand-name-chromium } የ{ -brand-name-google } ክፍት ምንጭ አሳሽ ፕሮጀክት ነው)።

source: Within the <a href="{ $firstyear }">first year</a>, new community members from around the world had already contributed new functionality, enhanced existing features and became engaged in the management and planning of the project itself.
am: በ<a href="{ $firstyear }">አንደኛ ዓመት</a> ውስጥ፣ ከዓለም ዙሪያ የተውጣጡ አዳዲስ የማህበረሰብ አባላት አዲስ ተግባር አበርክተዋል፣ ያሉትን ባህሪያት አሻሽለዋል እና በፕሮጀክቱ በራሱ አስተዳደር እና እቅድ ላይ ተሰማርተዋል።

source: With the latest version of { -brand-name-firefox }, <a { $attrs }>Enhanced Tracking Protection</a> is turned on by default in normal browsing mode, so you don’t have to mess around with the settings just to protect yourself from trackers. With Enhanced Tracking Protection, { -brand-name-firefox } actively blocks thousands of third-party trackers that try to follow you around the web. You are provided with a personalized protection report that shows how often { -brand-name-firefox } blocked third-party cookies, social media trackers, fingerprinting tools and cryptominers as you browse the web.
am: በአዲሱ የ{ -brand-name-firefox } ስሪት፣ <a { $attrs }>የተሻሻለ የመከታተያ ጥበቃ</a> በመደበኛ የአሰሳ ሁነታ በነባሪነት በርቷል፣ ስለዚህ ራስዎን ከመከታተያዎች ለመጠበቅ ሲባል ብቻ ቅንብሮችን በማስተካከል መጨናነቅ የለብዎትም። የተሻሻለ የመከታተያ ጥበቃ ጋር { -brand-name-firefox } በድር ዙሪያ እርስዎን ለመከተል የሚሞክሩ በሺዎች የሚቆጠሩ የሶስተኛ ወገን መከታተያዎችን በንቃት ያግዳል። ድሩን በሚያስሱበት ጊዜ { -brand-name-firefox } ምን ያህል ጊዜ የሶስተኛ ወገን ኩኪዎችን፣ ማህበራዊ ሚዲያ መከታተያዎችን፣ የጣት አሻራ መሳሪያዎችን እና ስነ ስውር ቆፋሪዎች እንደታገዱ የሚያሳይ ለግል የተበጀ የጥበቃ ሪፖርት ቀርቦልዎታል።

source: Work for a mission-driven organization that builds purpose-driven products.
am: ዓላማ-ተኮር ምርቶችን ለሚገነባ በተልዕኮ ለሚመራ ድርጅት ይስሩ።

source: Work for a mission-driven organization that makes people-first products.
am: ሰዎች-የመጀመሪያ ምርቶችን ለሚሰራ በተልዕኮ ለሚመራ ድርጅት ይስሩ።

source: Working at the grassroots and policy levels, we teach web literacy, provide tools and advocate on behalf of every individual who values an internet built on fairness, inclusion and respect.
am: በመሠረታዊ እና በመመሪያ ደረጃዎች በመስራት የድር ክህሎትን እናስተምራለን፣ መሳሪያዎችን እናቀርባለን እንዲሁም በፍትሃዊነት፣ በአካታችነት እና በአክብሮት ላይ የተገነባን በይነመረብ ዋጋ ለሚሰጥ እያንዳንዱ ግለሰብ ወክለን እንሟገታለን።

source: Working to keep the internet healthy, open and accessible to all, we teach web literacy, provide tools and advocate on behalf of every individual who values the internet as a global public resource.
am: በይነመረቡን ጤናማ፣ ክፍት እና ለሁሉም ተደራሽ ለማድረግ በመስራት የድር እውቀትን እናስተምራለን፣ መሳሪያዎችን እናቀርባለን እንዲሁም በይነመረብን እንደ አለምአቀፍ የህዝብ መገልገያ ዋጋ ለሚሰጡ እያንዳንዱ ግለሰብ ወክለን ድጋፍ እናደርጋለን።

source: Workplace
am: የስራ ቦታ

source: You already have a { -brand-name-firefox-account }. Congrats!
am: እንኳን ደስ ያለዎ! ቀድሞውንም { -brand-name-firefox-account } አለዎት።

source: You already have a { -brand-name-mozilla-account }. Congrats!
am: እንኳን ደስ ያለዎ! ቀድሞውንም { -brand-name-mozilla-account } አለዎት።

source: You can download { -brand-name-mozilla-vpn } on up to { $devices } devices with one subscription.
am: { -brand-name-mozilla-vpn }ን በአንድ የደንበኝነት ምዝገባ እስከ { $devices } መሳሪያዎች ላይ ማውረድ ይችላሉ።

source: You can reclaim your privacy and gain back control over your very own internet experience! It’s actually surprisingly easy. Everyone can do it.
am: የእርስዎን ግላዊነት መልሰው ማግኘት እና በራስዎ የበይነመረብ ተሞክሮ ላይ እንደገና ባለ ሙሉ ስልጣን መሆን ይችላሉ! በእውነቱ በሚገርም ሁኔታ ቀላል ነው። ሁሉም ሰው ማድረግ ይችላል።

source: You got it. Get { -brand-name-firefox } for mobile.
am: አግኝተውታል። ለስልክ { -brand-name-firefox }ን ያግኙ።

source: You’ll always get the truth from us. Everything we make and do honors our <a href="{ $promise }">Personal Data Promise</a>:
am: ሁልጊዜም ከእኛ ሀቀኛ አገልግሎትን ያገኛሉ። የምንሠራውና የምናደርገው ሁሉ <a href={ $promise }">ግላዊ መረጃን መጠበቅ</a>: የሚለውን መርህ በማክበር ነው።

source: Your <a { $attrs }>Privacy Protections</a> shows you the trackers and cookies that pages have attempted to leave, and how many { -brand-name-firefox } has blocked for you.
am: የእርስዎ <a { $attrs }>የግላዊነት ጥበቃዎች</a> ገጾች ለመውጣት የሞከሩባቸውን መከታተያዎች እና ኩኪዎች እና ስንት { -brand-name-firefox } እንደከለከሉ ያሳይዎታል።

source: Your { -brand-name-firefox-account }
am: የእርስዎ { -brand-name-firefox-account }

source: Your dedicated privacy browser with automatic tracking protection and ad blocking.
am: በራስ ሰር የመከታተያ ጥበቃ እና የማስታወቂያ እገዳ ያለው የእርስዎ የግላዊነት አሳሽ።

source: You’re signed <br>in to { -brand-name-firefox }. <br><span>Now try { -brand-name-firefox-monitor }.</span>
am: ወደ { -brand-name-firefox } <br> ገብተዋል። <br><span>አሁን { -brand-name-firefox-monitor }ን ይሞክሩ።</span>

source: You’re using an insecure, outdated operating system <a href="{ $url }">no longer supported by { -brand-name-firefox }</a>.
am: የሚጠቀሙት ደህንነቱ የማያስተማምን፣ ጊዜው ያለፈበት ስርዓተ ክወና <a href="{ $url }">ከአሁን በኋላ በ{ -brand-name-firefox } አይደገፍም</a>።

source: Your favorite extensions
am: የእርስዎ ተወዳጅ ቅጥያዎች

source: Your privacy is our promise
am: የእርስዎ ግላዊነት የእኛ ቃል-ኪዳን ነው

source: Your right to security and privacy on the internet is fundamental – never optional.
am: በበይነ መረብ ላይ ያለዎ የደህንነት እና የግላዊነት መብት መሰረታዊ ነው - በጭራሽ አማራጭ አይደለም።

source: Your system doesn’t meet the <a href="{ $url }">requirements</a> to run { -brand-name-firefox }.
am: የእርስዎ ስርዓት { -brand-name-firefox }ን ለማሄድ <a href="{ $url }">መስፈርቶቹን</a> አያሟላም።

source: Your talents are needed for a better internet
am: ለተሻለ በይነመረብ ችሎታዎ ያስፈልጋል

source: You’ve already got the browser. Now get even more from { -brand-name-firefox }.
am: አስቀድመው አሳሹን አግኝተዋል። አሁን ከ{ -brand-name-firefox } የበለጠ ያግኙ።

source: account recovery key
am: የመለያ መልሶ ማግኛ ቁልፍ

source: add-on
am: ተጨማሪ

source: alternate text
am: ተለዋጭ ጽሑፍ

source: appearance
am: ገፅታ

source: attack
am: ጥቃት

source: attacker
am: አጥቂ

source: Attack Site
am: ማጥቂያ ቦታ

source: attendee
am: ተሳታፊ

source: authenticate
am: ማረጋገጥ

source: authenticated
am: የተረጋገጠ

source: authentication code
am: የማረጋገጫ ኮድ

source: autoplay
am: ራስ-ተጫዋች

source: backup authentication code
am: የመጠባበቂያ ማረጋገጫ ኮድ

source: bookmark
am: እልባት

source: breakpoint
am: መግቻ ቦታ

source: Bug report
am: የሳንካ ሪፖርት

source: certificate authority
am: የምስክር ወረቀት ባለስልጣን

source: cipher
am: ማመስጠሪያ

source: clipboard
am: የቅንጥብ ሰሌዳ

source: colorway
am: ቀለም መምረጫ

source: confirmation code
am: ማረጋግጫ ኮድ

source: context
am: አውድ

source: cookie banner
am: የኩኪ ሰሌዳ

source: corrupt
am: ብልሹ

source: corrupted
am: ተበላሽቷል

source: crash
am: ብልሽት

source: cross-site tracking cookie
am: ተሻጋሪ-ገጽ መከታተያ ኩኪ

source: cryptominer
am: ምናባዊ ገንዘብ መቆፈሪያ

source: cryptomining
am: ምናባዊ ገንዘብ መቆፈር

source: debug
am: ማረም

source: deceptive site
am: አታላይ ጣቢያ

source: decode
am: መፍታት

source: decryption
am: የተመሰጠረን መፍታት

source: disinformation
am: የተሳሳተ መረጃ

source: distrust
am: አለማመን

source: email mask
am: የኢሜል ጭምብል

source: enable
am: አስጀምር

source: encode
am: ቋጥር

source: encrypt
am: አመስጥር

source: encryption
am: ማመስጠር

source: end user
am: ተጠቃሚ

source: extension
am: ቅጥያ

source: fingerprinter
am: ጣት-አሻራ ሰብሳቢ

source: fingerprinting
am: የአሳሽ አሻራ መከታተል

source: Firefox View
am: የፋየርፎክስ እይታ

source: grassroots
am: ጠንሳሽ

source: home page
am: መነሻ ገጽ

source: import
am: አስገባ

source: independent browser
am: ገለልተኛ አሳሽ

source: innovations
am: ፈጠራዎች

source: insecure
am: ደህንነቱ የማያስተማምን

source: installation
am: ማቀናበር

source: Issue
am: ችግር

source: Legacy extension
am: የቆየ ቅጥያ

source: misinformation
am: የተሳሳተ መረጃ

source: native
am: አካባቢያዊ

source: net neutrality
am: የተጣራ ገለልተኛነት

source: nonprofit
am: ለትርፍ ያልተቋቋመ

source: non-profit
am: ለትርፍ ያልተቋቋመ

source: open source
am: ክፍት ምንጭ

source: override
am: መሻር

source: phone number mask
am: የስልክ ቁጥር ጭምብል

source: pop-up
am: ብቅታ

source: preference
am: ምርጫ

source: release
am: መልቀቅ

source: report
am: አሳውቅ

source: restricted site
am: የተገደበ ድረ-ገጽ

source: revert
am: መመለስ

source: review checker
am: የግምገማ አረጋጋጭ

source: search suggestion
am: የፍለጋ ጥቆማ

source: security keys
am: የደህንነት ቁልፎች

source: sensitive
am: ጥንቃቄ የሚሻ

source: sidebar
am: የጎን አሞሌ

source: sign
am: መፈረም

source: signer
am: ፈራሚ

source: sign in
am: ግባ

source: sign-in
am: ይግቡ

source: studies
am: ጥናቶች

source: track
am: መከታተል

source: trackers
am: መከታተያዎች

source: unencrypted
am: ያልተመሰጠረ

source: unresponsive
am: ምላሽ የማይሰጥ

source: unsafe
am: አስጊ

source: validate
am: አረጋግጥ

source: validity
am: ትክክለኛነት

source: version
am: ስሪት

source: Web Authentication
am: የድር ማረጋገጫ
